console.log('==============================================================================');
console.log('1. 변수 x가 10보다 크고 20보다 작을 때 변수 x를 출력하는 조건식을 완성하라.');

(function () {
  const x = 15;

  if (x > 10 && x < 20) {
    console.log(x);
  }
})();

console.log('==============================================================================');
console.log('2. for문을 사용하여 0부터 10미만의 정수 중에서 짝수만을 작은 수부터 출력하시오.');

(function () {
  for (let i = 0; i < 10; i += 2) {
    console.log(i);
  }
})();

console.log('==============================================================================');
console.log('3. for문을 사용하여 0부터 10미만의 정수 중에서 짝수만을 작은 수부터 문자열로 출력하시오.');

(function () {
  let evenString = '';

  for (let i = 0; i < 10; i += 2) {
    evenString += i;
  }
  console.log(evenString);
})();


console.log('==============================================================================');
console.log('4. for문을 사용하여 0부터 10미만의 정수 중에서 홀수만을 큰수부터 출력하시오.');

(function () {
  for (let i = 9; i > 0; i -= 2) {
    console.log(i);
  }
})();

console.log('==============================================================================');
console.log('5. while문을 사용하여 0 부터 10 미만의 정수 중에서 짝수만을 작은 수부터 출력하시오.');

(function () {
  let i = 0;
  while (i < 10) {
    console.log(i);
    i += 2;
  }
})();

console.log('==============================================================================');
console.log('6. while문을 사용하여 0 부터 10 미만의 정수 중에서 홀수만을 큰수부터 출력하시오.');

(function () {
  let i = 9;
  while (i > 0) {
    console.log(i);
    i -= 2;
  }
})();

console.log('==============================================================================');
console.log('7. for 문을 사용하여 0부터 10미만의 정수의 합을 출력하시오.');

(function () {
  let sum = 0;

  for (let i = 0; i < 10; i++) {
    sum += i;
  }
  console.log(sum);
})();

console.log('==============================================================================');
console.log('8. 1부터 20 미만의 정수 중에서 2 또는 3의 배수가 아닌 수의 총합을 구하시오.');

(function () {
  let sum = 0;

  for (let i = 1; i < 20; i++) {
    sum += (i % 2 !== 0 && i % 3 !== 0) ? i : 0;
  }
  console.log(sum);
})();

console.log('==============================================================================');
console.log('9. 1부터 20 미만의 정수 중에서 2 또는 3의 배수인 수의 총합을 구하시오.');

(function () {
  let sum = 0;

  for (let i = 1; i < 20; i++) {
    sum += (i % 2 === 0 || i % 3 === 0) ? i : 0;
  }
  console.log(sum);
})();

console.log('==============================================================================');
console.log('10. 두 개의 주사위를 던졌을 때, 눈의 합이 6이 되는 모든 경우의 수를 출력하시오.');

(function () {
  for (let i = 1; i <= 6; i++) {
    for (let j = 1; j <= 6; j++) {
      (i + j === 6) ? console.log(`[ ${i}, ${j} ]`) : '';
    }
  }
})();

console.log('==============================================================================');
console.log('11. 삼각형 출력하기 - pattern 1');

(function () {
  let star = '';
  for (let i = 0; i < 5; i++) {
    star += '*';
    console.log(star);
  }
})();

console.log('==============================================================================');
console.log('12. 삼각형 출력하기 - pattern 2');

(function () {
  for (let i = 5; i > 0; i--) {
    let star = '';
    for (let j = 5; j > i ; j--) {
      star += ' ';
    }
    for (let k = 0; k < i; k++) {
      star += '*';
    }
    console.log(star);
  }
})();

console.log('==============================================================================');
console.log('13. 삼각형 출력하기 - pattern 3');

(function () {
  for (let i = 5; i > 0; i--) {
    let star = '';
    for (let j = 0; j < i; j++) {
      star += '*';
    }
    console.log(star);
  }
})();

console.log('==============================================================================');
console.log('14. 삼각형 출력하기 - pattern 4');

(function () {
  for (let i = 0; i < 5; i++) {
    let star = '';
    for (let j = 4; j > i ; j--) {
      star += ' ';
    }
    for (let k = 0; k < (i + 1); k++) {
      star += '*';
    }
    console.log(star);
  }
})();

console.log('==============================================================================');
console.log('15. 정삼각형 출력하기');

(function () {
  for (let i = 0; i < 5; i++) {
    let star = '';
    for (let j = 4; j > i ; j--) {
      star += ' ';
    }
    for (let k = 0; k < ((2 * i) + 1); k ++) {
      star += '*';
    }
    for (let l = 4; l > i ; l--) {
      star += ' ';
    }
    console.log(star);
  }
})();

console.log('==============================================================================');
console.log('16. 역정삼각형 출력하기');

(function () {
  for (let i = 5; i > 0; i--) {
    let star = '';
    for (let j = 5; j > i; j--) {
      star += ' ';
    }
    for (let k = 0; k < ((2 * i) - 1); k++) {
      star += '*';
    }
    for (let l = 5; l > i ; l--) {
      star += ' ';
    }
    console.log(star);
  }
})();

console.log('==============================================================================');